<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'ناو',
    'column.guard_name' => 'ناوی پاسەوان',
    'column.roles' => 'ڕۆڵەکان',
    'column.permissions' => 'مۆڵەتەکان',
    'column.updated_at' => 'نوێکراوەتەوە لە',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'ناو',
    'field.guard_name' => 'ناوی پاسەوان',
    'field.permissions' => 'مۆڵەتەکان',
    'field.select_all.name' => 'دیاری کردنی هەموو',
    'field.select_all.message' => 'هەموو مۆڵەتەکان بۆ ئەم ڕۆڵە چالاک بکە',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'بەڕێوەبردنی دەستڕاگەیشتن',
    'nav.role.label' => 'ڕۆڵەکان',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'ئەرک',
    'resource.label.roles' => 'ڕۆڵەکان',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'یەکەکان',
    'resources' => 'سەرچاوەکان',
    'widgets' => 'ویجتەکان',
    'pages' => 'لاپەڕەکان',
    'custom' => 'مۆڵەتی تایبەتمەند',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'مۆڵەتی دەستگەیشتنت نییە',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'دیمەن',
        'view_any' => 'بینینی هەریەک',
        'create' => 'دروستکردن',
        'update' => 'نوێکردنەوە',
        'delete' => 'سڕینەوە',
        'delete_any' => 'سڕینەوەی هەریەکەیان',
        'force_delete' => 'بە زۆر سڕینەوە',
        'force_delete_any' => 'ناچاری سڕینەوە هەر',
        'restore' => 'گەڕاندنەوە',
        'reorder' => 'دووبارە ڕێکخستنەوە',
        'restore_any' => 'گەڕاندنەوەی هەر',
        'replicate' => 'دووبارەکردنەوە',
        'export_all' => 'هەناردەکردنی هەموو پڕۆژەکان'
    ],
];
